nairkrishna18/ESP32_FOTA_T1/src/esp32fota_Edited.cpp
/*
   esp32 firmware OTA
   Date: December 2018
   Author: Chris Joyce <https://github.com/chrisjoyce911/esp32FOTA/esp32FOTA>
   Purpose: Perform an OTA update from a bin located on a webserver (HTTP Only)
   Edited By: AKSHAY ATKAR
*/

#include "esp32fota_Edited.h"
#include "Arduino.h"
#include <WiFi.h>
#include <HTTPClient.h>
#include "Update_Edited.h"
#include "ArduinoJson.h"

#include <WiFiClientSecure.h>

#include <esp_task_wdt.h>           //ARA191121

bool bErrorInUpdating = 0;          //ARA191121
bool bUpdateComplete = 0;           //ARA191121

esp32FOTA::esp32FOTA(String firwmareType, float firwmareVersion)
{
    _firwmareType = firwmareType;
    _firwmareVersion = firwmareVersion;
    useDeviceID = false;
}
//-----------------------ARA271121-----------------------------------------
// esp32FOTA::esp32FOTASpecial(String firwmareType_, float_t firwmareVersion_)
// {
//     _firwmareType = firwmareType_;
//     _firwmareVersion = firwmareVersion_;
//     useDeviceID = false;
// }
//----------------------ARA271121------------------------------------------


static void splitHeader(String src, String &header, String &headerValue)
{
    int idx = 0;

    idx = src.indexOf(':');
    header = src.substring(0, idx);
    headerValue = src.substring(idx + 1, src.length());
    headerValue.trim();

    return;
}



/*--------ARA261121----------------------------------------------------------------------*/
// OTA Logic
void esp32FOTA::execOTASpecial()
{

    WiFiClient client;
    int contentLength = 0;
    int contentLengthForPerc = 0;
    bool isValidContentType = false;
    bool gotHTTPStatus = false;

    Serial.println("Connecting to: " + String(_host));
    // Connect to Webserver
    if (client.connect(_host.c_str(), _port))
    {
        // Connection Succeed.
        // Fetching the bin
        Serial.println("Fetching Bin: " + String(_bin));

        // Get the contents of the bin file
        client.print(String("GET ") + _bin + " HTTP/1.1\r\n" +
                     "Host: " + _host + "\r\n" +
                     "Cache-Control: no-cache\r\n" +
                     "Connection: close\r\n\r\n");

        unsigned long timeout = millis();
        while (client.available() == 0)
        {
            if (millis() - timeout > 5000)
            {
                bUpdateComplete = 1;                   //ARA261121
                Serial.println("Client Timeout !");
                client.stop();
                return;
            }
        }

        while (client.available())
        {
            String header, headerValue;
            // read line till /n
            String line = client.readStringUntil('\n');
            Serial.println(line);           //ARA031221
            // remove space, to check if the line is end of headers
            line.trim();

            if (!line.length())
            {
                //headers ended
                break; // and get the OTA started
            }

            // Check if the HTTP Response is 200
            // else break and Exit Update
            if (line.startsWith("HTTP/1.1"))
            {
                if (line.indexOf("200") < 0)
                {
                    bUpdateComplete = 1;                   //ARA261121
                    Serial.println("Firmware.bin file not present in server/Winscp/Git"); //KRN101221
                    Serial.println("Got a non 200 status code from server. Exiting OTA Update.");
                    client.stop();
                    break;
                }
                gotHTTPStatus = true;
            }

            if (false == gotHTTPStatus)
            {
                continue;
            }

            splitHeader(line, header, headerValue);

            // extract headers here
            // Start with content length
            if (header.equalsIgnoreCase("Content-Length"))
            {
                contentLength = headerValue.toInt();
                contentLengthForPerc = contentLength;           //ARA031221
                Serial.println("Got " + String(contentLength) + " bytes from server");
                continue;
            }

            // Next, the content type
            if (header.equalsIgnoreCase("Content-type"))
            {
                String contentType = headerValue;
                Serial.println("Got " + contentType + " payload.");
                if (contentType == "application/octet-stream")
                {
                    isValidContentType = true;
                }
            }
        }
    }
    else
    {
        // Connect to webserver failed
        // May be try?
        // Probably a choppy network?
        bUpdateComplete = 1;                   //ARA261121
        Serial.println("Connection to " + String(_host) + " failed. Please check your setup");
        // retry??
        // execOTA();
    }

    // Check what is the contentLength and if content type is `application/octet-stream`
    Serial.println("contentLength : " + String(contentLength) + ", isValidContentType : " + String(isValidContentType));

    // check contentLength and content type
    if (contentLength && isValidContentType)
    {
        // Check if there is enough to OTA Update
        bool canBegin = Update.begin(contentLength);

        // If yes, begin
        if (canBegin)
        {
            Serial.println("Begin OTA. This may take 2 - 5 mins to complete. Things might be quite for a while.. Patience!");
            // No activity would appear on the Serial monitor
            // So be patient. This may take 2 - 5mins to complete
            size_t written = Update.writeStreamEdited(client,contentLengthForPerc);
                // if(Update.remaining())
                // {
                //     written = Update.writeStreamEdited2(client,contentLengthForPerc);
                // }
            if (written == contentLength)
            {
                Serial.println("Written : " + String(written) + " successfully");
            }
            else
            {
                Serial.println("Written only : " + String(written) + "/" + String(contentLength) + ". Retry?");
                // retry??
                // execOTA();
            }

            if (Update.end())
            {
                Serial.println("OTA done!");
                if (Update.isFinished())
                {
                    Serial.println("Update successfully completed. Rebooting.");
                    bUpdateComplete = 1;                   //ARA261121
                    //ESP.restart();
                }
                else
                {
                    bErrorInUpdating = 1;                   //ARA261121
                    Serial.println("Update not finished? Something went wrong!");
                }
            }
            else
            {
                bErrorInUpdating = 1;                   //ARA261121
                Serial.println("Error Occurred. Error #: " + String(Update.getError()));
            }
        }
        else
        {
            // not enough space to begin OTA
            // Understand the partitions and
            // space availability
            bErrorInUpdating = 1;                   //ARA261121
            Serial.println("Not enough space to begin OTA");
            client.flush();
        }
    }
    else
    {
        Serial.println("There was no content in the response");
        bErrorInUpdating = 1;                   //ARA261121
        client.flush();
    }
}
/*--------ARA261121----------------------------------------------------------------------*/



// OTA Logic
void esp32FOTA::execOTA()
{

