nairkrishna18/ESP32_FOTA_T1/src/esp32fota_Edited.cpp
            _host = jshost;
            _bin = jsbin;

            ivar1 = plversion * 100;
            ivar2 = _firwmareVersion * 100;

            String fwtype(pltype);
            Serial.print("plversion=");
            Serial.println(plversion);
            Serial.print("_firwmareVersion=");
            Serial.println(_firwmareVersion);

            Serial.print("ivar1=");
            Serial.println(ivar1);
            Serial.print("ivar2=");
            Serial.println(ivar2);

            #if 1
                if ((ivar1  == ivar2)||(fwtype != _firwmareType))
                // if ((ivar1  == ivar2))
                // if ((_firwmareVersion  == plversion))
                {
                    Serial.println("FAILED TO COMPARE.........!!!");
                    return false;                
                }
                else
                if ((ivar1  != ivar2)&&(fwtype == _firwmareType))
                {
                    Serial.println("NEED TO UPDATE.........!!!");
                    return true;
                }
           

            // if ((fwtype == _firwmareType))
            // {            
            //     if ((_firwmareVersion  != plversion))
            //     {
            //         Serial.println("NEED TO UPDATE.........!!!");
            //         return true;
            //     }
            //     else
            //     {
            //         Serial.println("FAILED TO COMPARE.........!!!");
            //         return false;
            //     }
            // }
            #else
                if ((fwtype == _firwmareType))
                if ((_firwmareVersion  != plversion))
                {
                    Serial.println("NEED TO UPDATE.........!!!");
                    return true;
                }
                else
                {
                    Serial.println("FAILED TO COMPARE.........!!!");
                    return false;
                }
            #endif
        }

        else
        {
            Serial.println("Error on HTTP request");
            return false;
        }

        http.end(); //Free the resources
        return false;
    }
    return false;
}
/*--------ARA261121----------------------------------------------------------------------*/




bool esp32FOTA::execHTTPcheck()
{

    String useURL;

    if (useDeviceID)
    {
        // String deviceID = getDeviceID() ;
        useURL = checkURL + "?id=" + getDeviceID();
    }
    else
    {
        useURL = checkURL;
    }

    _port = 80;

    Serial.println("Getting HTTP");
    Serial.println(useURL);
    Serial.println("------");
    if ((WiFi.status() == WL_CONNECTED))
    { //Check the current connection status

        HTTPClient http;

        http.begin(useURL);        //Specify the URL
        int httpCode = http.GET(); //Make the request
		Serial.println("httpCodeRecevied");
		Serial.print(httpCode,DEC);
        if (httpCode == 200)
        { //Check is a file was returned

            String payload = http.getString();

            int str_len = payload.length() + 1;
            char JSONMessage[str_len];
            payload.toCharArray(JSONMessage, str_len);
			      Serial.print(JSONMessage);
            StaticJsonDocument<500> JSONDocument; //Memory pool
            DeserializationError err = deserializeJson(JSONDocument, JSONMessage);

            if (err)
            { //Check for errors in parsing
                Serial.println("Parsing failed");
                delay(5000);
                return false;
            }

            const char *pltype = JSONDocument["type"];
            float plversion = JSONDocument["version"];
            const char *plhost = JSONDocument["host"];
            _port = JSONDocument["port"];
            const char *plbin = JSONDocument["bin"];

            String jshost(plhost);
            String jsbin(plbin);

            _host = jshost;
            _bin = jsbin;

            String fwtype(pltype);

            if (plversion != _firwmareVersion && fwtype == _firwmareType)
            {
                return true;
            }
            else
            {
                return false;
            }
        }

        else
        {
            Serial.println("Error on HTTP request");
            return false;
        }

        http.end(); //Free the resources
        return false;
    }
    return false;
}

String esp32FOTA::getDeviceID()
{
    char deviceid[21];
    uint64_t chipid;
    chipid = ESP.getEfuseMac();
    sprintf(deviceid, "%" PRIu64, chipid);
    String thisID(deviceid);
    return thisID;
}

// Force a firmware update regartless on current version
void esp32FOTA::forceUpdate(String firmwareHost, int firmwarePort, String firmwarePath)
{
    _host = firmwareHost;
    _bin = firmwarePath;
    _port = firmwarePort;
    execOTA();
}

//=============================================================================
//=======================UPDATE OVER HTTPS=====================================
//=============================================================================

/*
This structure describes the characteristics of a firmware, namely:
the host where it is located
the path of the actual bin file 
the port where it can be retrieved
the type of target device
the version of the firmware
*/
typedef struct
{
    int version;
    int port;
    String host;
    String bin;
    String type;
} OTADescription;

/*
The constructor sets only the firmware type and its versions, as these two 
parameters are hardcoded in the device. The other parameters have to be set 
separately.
*/
secureEsp32FOTA::secureEsp32FOTA(String firwmareType, float firwmareVersion)
{
    _firwmareType = firwmareType;
    _firwmareVersion = firwmareVersion;
}

//---------ARA271121------------------------------------------------------
/*
The constructor sets only the firmware type and its versions, as these two 
parameters are hardcoded in the device. The other parameters have to be set 
separately.
*/
// secureEsp32FOTA::secureEsp32FOTASpecial(String firwmareType, float firwmareVersion)
// {
//     _firwmareType = firwmareType;
//     _firwmareVersion = firwmareVersion;
// }
//---------ARA271121------------------------------------------------------

