nairkrishna18/ESP32_FOTA_T1/src/esp32fota_Edited.cpp
/*
This function initializes the connection with the server, verifying that it is
compliant with the provided certificate.
*/
bool secureEsp32FOTA::prepareConnection(String destinationServer)
{
    char *certificate = _certificate;
    clientForOta.setCACert(certificate);
    if (clientForOta.connect(destinationServer.c_str(), _securePort))
    {
        return true;
    }
    return false;
}

/*
This function performs a GET request to fetch a resource over HTTPS.
It makes use of the attributes of the class, that have to be already set.
In particular, it makes use of the certificate, the descriptionOfFirmwareURL, 
the host.
*/
String secureEsp32FOTA::secureGetContent()
{
    String destinationURL = _descriptionOfFirmwareURL;
    char *certificate = _certificate;
    noInterrupts();
    bool canConnectToServer = prepareConnection(_host);
    interrupts();
    delay(100);
    if (canConnectToServer)
    {
        //Serial.println("connected");
        clientForOta.println("GET https://" + String(_host) + destinationURL + " HTTP/1.0");
        clientForOta.println("Host: " + String(_host) + "");
        clientForOta.println("Connection: close");
        clientForOta.println();
        
        if(clientForOta.connected())
        {
            Serial.println("clientForOta.connected---------");
        }
        else
        {
            Serial.println("clientForOta.NOT.connected---------");
        }
        while (clientForOta.connected())
        {
            String line = clientForOta.readStringUntil('\n');
            if (line == "\r")
            {
                //Serial.println("headers received");
                break;
            }
        }

        String partialContentOfHTTPSResponse = "";
        while (clientForOta.available())
        {
            char c = clientForOta.read();
            partialContentOfHTTPSResponse += c;
            Serial.print(c);
        }
        clientForOta.stop();
        return partialContentOfHTTPSResponse;
    }
    else
    {
        Serial.println("Connection Failed..................!");
    }
    clientForOta.stop();
    return "";
}

/*
This function checks whether it is necessary to perform an OTA update.
It fetches the description of a firmware from the host, reading descriptionOfFirmwareURL.
In case the version of the fetched firmware is greater than the current version, and 
the content has the right format, it returns true, and it modifies the attributes 
of secureEsp32FOTA accordingly.
*/
bool secureEsp32FOTA::execHTTPSCheck()
{
    char *certificate = _certificate;

    String destinationUrl = _descriptionOfFirmwareURL;
    OTADescription obj;
    OTADescription *description = &obj;

    String unparsedDescriptionOfFirmware = secureGetContent();

    int str_len = unparsedDescriptionOfFirmware.length() + 1;
    char JSONMessage[str_len];
    unparsedDescriptionOfFirmware.toCharArray(JSONMessage, str_len);
	// Serial.println(JSONMessage);
    StaticJsonDocument<500> JSONDocument; //Memory pool
    DeserializationError err = deserializeJson(JSONDocument, JSONMessage);
    Serial.println("Current Version No: " + String(_firwmareVersion));
    //Serial.println(_firwmareVersion);

    if (err)
    { //Check for errors in parsing
        Serial.println("Parsing failed.............!");
        delay(500);
        return false;
    }

    description->type = JSONDocument["type"].as<String>();

    description->host = JSONDocument["host"].as<String>();
    description->version = JSONDocument["version"].as<int>();
    description->bin = JSONDocument["bin"].as<String>();

    clientForOta.stop();

    if (description->version > _firwmareVersion && description->type == _firwmareType)
    {
        locationOfFirmware = description->host;
        _bin = description->bin;
        // Serial.println(JSONMessage);
        return true;
    }

    return false;
}

/*--------ARA241121----------------------------------------------------------------------*/
/*
This function checks whether it is necessary to perform an OTA update.
It fetches the description of a firmware from the host, reading descriptionOfFirmwareURL.
In case the version of the fetched firmware is greater than the current version, and 
the content has the right format, it returns true, and it modifies the attributes 
of secureEsp32FOTA accordingly.
*/
uint8_t secureEsp32FOTA::execHTTPSCheckSpecial()
{
    char *certificate = _certificate;

    String destinationUrl = _descriptionOfFirmwareURL;
    OTADescriptionSpecial obj;
    OTADescriptionSpecial *description = &obj;

    String unparsedDescriptionOfFirmware = secureGetContent();

    int str_len = unparsedDescriptionOfFirmware.length() + 1;
    char JSONMessage[str_len];
    unparsedDescriptionOfFirmware.toCharArray(JSONMessage, str_len);
	Serial.println(JSONMessage);
    StaticJsonDocument<500> JSONDocument; //Memory pool
    DeserializationError err = deserializeJson(JSONDocument, JSONMessage);
    Serial.println("Current Version No: " + String(_firwmareVersion));
    //Serial.println(_firwmareVersion);

    if (err)
    { //Check for errors in parsing
        Serial.println("Parsing failed.............!");
        delay(500);
        return false;
    }

    description->type = JSONDocument["type"].as<String>();
    SturOtaJsonReceiv.type = JSONDocument["type"].as<String>();

    description->For = JSONDocument["For"].as<String>();
    SturOtaJsonReceiv.For = JSONDocument["For"].as<String>();

    description->host = JSONDocument["host"].as<String>();
    SturOtaJsonReceiv.host = JSONDocument["host"].as<String>();

    description->version = JSONDocument["version"].as<float>();
    SturOtaJsonReceiv.version = JSONDocument["version"].as<float>();

    description->bin = JSONDocument["bin"].as<String>();
    SturOtaJsonReceiv.bin = JSONDocument["bin"].as<String>();
    Serial.println(JSONMessage);

    clientForOta.stop();

    if (description->version != _firwmareVersion && description->type == _firwmareType)
    {
        //if(description->For == "FW_ALL")
        //{
        locationOfFirmware = description->host;
        _bin = description->bin;
        //Serial.println(JSONMessage);
        return true;
        //}
    }

