nairkrishna18/ESP32_FOTA_T1/src/esp32fota_Edited.cpp
    return false;
}
/*--------ARA241121----------------------------------------------------------------------*/



/*
This function checks whether the content of a response is a firmware.
*/
bool secureEsp32FOTA::isValidContentType(String contentType)
{
    if (contentType == "application/octet-stream")
    {
        return true;
    }

    return false;
}

/*
This function launches an OTA, using the attributes of the class that describe it:
server, url and certificate.
*/

void secureEsp32FOTA::executeOTA()
{
    char *certificate = _certificate;

    Serial.println("location of fw " + String(locationOfFirmware) + _bin + " HTTP/1.0");

    bool canCorrectlyConnectToServer = prepareConnection(locationOfFirmware);
    int contentLength;
    int contentLengthForPerc = 0;
    bool isValid;
    bool gotHTTPStatus = false;
    //esp_task_wdt_reset();               //ARA191121
    if (canCorrectlyConnectToServer)
    {
        //Serial.println("ok");

        clientForOta.println("GET https://" + String(locationOfFirmware) + _bin + " HTTP/1.0");
        clientForOta.println("Host: " + String(locationOfFirmware) + "");
        clientForOta.println("Connection: close");
        clientForOta.println();

        while (clientForOta.connected())
        {
            
            String header, headerValue;
            // read line till /n
            String line = clientForOta.readStringUntil('\n');
			Serial.println(line);							//ARA221021
            // remove space, to check if the line is end of headers
            line.trim();
            //esp_task_wdt_reset();               //ARA191121
            if (!line.length())
            {
                //headers ended
                break; // and get the OTA started
            }

            if (line.startsWith("HTTP/1.1"))
            {
                if (line.indexOf("200") < 0)
                {
                    //Serial.println("Got a non 200 status code from server. Exiting OTA Update.");
                    break;
                }
                gotHTTPStatus = true;
            }

            if (false == gotHTTPStatus)
            {
                continue;
            }

            splitHeader(line, header, headerValue);
            // extract headers here
            // Start with content length
            if (header.equalsIgnoreCase("Content-Length"))
            {
                contentLength = headerValue.toInt();
                contentLengthForPerc = contentLength;
                continue;
            }

            // Next, the content type
            if (header.equalsIgnoreCase("Content-Type"))
            {
                isValid = isValidContentType(headerValue);
            }
            if(bErrorInUpdating == 1)
            {
                break;
            }
        }

        if (contentLength && isValid)
        {
            //Serial.println("beginn");
            bool canBegin = Update.begin(contentLength);
            if (canBegin)
            {
                //Serial.println("Begin OTA. This may take 2 - 5 mins to complete. Things might be quite for a while.. Patience!");

                //size_t written = Update.writeStream(clientForOta);
                size_t written = Update.writeStreamEdited(clientForOta,contentLengthForPerc);
                Serial.println("Written : " + String(written) + " Writting file");
                Serial.println(clientForOta);
                if (written == contentLength)
                {
                    Serial.println("Written : " + String(written) + " successfully");
                }
                else
                {
                    Serial.println("Written only : " + String(written) + "/" + String(contentLength) + ". Retry?");
                }

                if(written == 0)
                {
                    Serial.println("Update not finished? Something went wrong!");
                    bErrorInUpdating = 1;                   //ARA111121
                }

                if (Update.end())
                {
                    Serial.println("OTA done!");
                    if (Update.isFinished())
                    {
                        Serial.println("Update successfully completed. Rebooting.");
                        bUpdateComplete = 1;
                        //ESP.restart();
                    }
                    else
                    {
                        Serial.println("Update not finished? Something went wrong!");
                        bErrorInUpdating = 1;                   //ARA111121
                    }
                }
                else
                {
                    Serial.println("Error Occurred. Error #: " + String(Update.getError()));
                    bErrorInUpdating = 1;                   //ARA111121
                }
            }
            else
            {
                Serial.println(" could not begin");
                bErrorInUpdating = 1;                   //ARA111121
            }
        }
        else
        {
            Serial.println("Content invalid");
            bErrorInUpdating = 1;                   //ARA111121
        }
    }
    else
    {
        Serial.println("Generic error");
        bErrorInUpdating = 1;                   //ARA111121
    }
}


